nxp-mcuxpresso/mcux-sdk/devices/MIMXRT1175/mcuxpresso/startup_mimxrt1175_cm7.cpp
WEAK void LPSPI3_IRQHandler(void)
{   LPSPI3_DriverIRQHandler();
}

WEAK void LPSPI4_IRQHandler(void)
{   LPSPI4_DriverIRQHandler();
}

WEAK void LPSPI5_IRQHandler(void)
{   LPSPI5_DriverIRQHandler();
}

WEAK void LPSPI6_IRQHandler(void)
{   LPSPI6_DriverIRQHandler();
}

WEAK void CAN1_IRQHandler(void)
{   CAN1_DriverIRQHandler();
}

WEAK void CAN1_ERROR_IRQHandler(void)
{   CAN1_ERROR_DriverIRQHandler();
}

WEAK void CAN2_IRQHandler(void)
{   CAN2_DriverIRQHandler();
}

WEAK void CAN2_ERROR_IRQHandler(void)
{   CAN2_ERROR_DriverIRQHandler();
}

WEAK void CAN3_IRQHandler(void)
{   CAN3_DriverIRQHandler();
}

WEAK void CAN3_ERROR_IRQHandler(void)
{   CAN3_ERROR_DriverIRQHandler();
}

WEAK void FLEXRAM_IRQHandler(void)
{   FLEXRAM_DriverIRQHandler();
}

WEAK void KPP_IRQHandler(void)
{   KPP_DriverIRQHandler();
}

WEAK void Reserved68_IRQHandler(void)
{   Reserved68_DriverIRQHandler();
}

WEAK void GPR_IRQ_IRQHandler(void)
{   GPR_IRQ_DriverIRQHandler();
}

WEAK void Reserved70_IRQHandler(void)
{   Reserved70_DriverIRQHandler();
}

WEAK void LCDIFv2_IRQHandler(void)
{   LCDIFv2_DriverIRQHandler();
}

WEAK void Reserved72_IRQHandler(void)
{   Reserved72_DriverIRQHandler();
}

WEAK void Reserved73_IRQHandler(void)
{   Reserved73_DriverIRQHandler();
}

WEAK void MIPI_CSI_IRQHandler(void)
{   MIPI_CSI_DriverIRQHandler();
}

WEAK void MIPI_DSI_IRQHandler(void)
{   MIPI_DSI_DriverIRQHandler();
}

WEAK void GPU2D_IRQHandler(void)
{   GPU2D_DriverIRQHandler();
}

WEAK void GPIO6_Combined_0_15_IRQHandler(void)
{   GPIO6_Combined_0_15_DriverIRQHandler();
}

WEAK void GPIO6_Combined_16_31_IRQHandler(void)
{   GPIO6_Combined_16_31_DriverIRQHandler();
}

WEAK void DAC_IRQHandler(void)
{   DAC_DriverIRQHandler();
}

WEAK void KEY_MANAGER_IRQHandler(void)
{   KEY_MANAGER_DriverIRQHandler();
}

WEAK void WDOG2_IRQHandler(void)
{   WDOG2_DriverIRQHandler();
}

WEAK void SNVS_HP_NON_TZ_IRQHandler(void)
{   SNVS_HP_NON_TZ_DriverIRQHandler();
}

WEAK void SNVS_HP_TZ_IRQHandler(void)
{   SNVS_HP_TZ_DriverIRQHandler();
}

WEAK void SNVS_PULSE_EVENT_IRQHandler(void)
{   SNVS_PULSE_EVENT_DriverIRQHandler();
}

WEAK void CAAM_IRQ0_IRQHandler(void)
{   CAAM_IRQ0_DriverIRQHandler();
}

WEAK void CAAM_IRQ1_IRQHandler(void)
{   CAAM_IRQ1_DriverIRQHandler();
}

WEAK void CAAM_IRQ2_IRQHandler(void)
{   CAAM_IRQ2_DriverIRQHandler();
}

WEAK void CAAM_IRQ3_IRQHandler(void)
{   CAAM_IRQ3_DriverIRQHandler();
}

WEAK void CAAM_RECORVE_ERRPR_IRQHandler(void)
{   CAAM_RECORVE_ERRPR_DriverIRQHandler();
}

WEAK void CAAM_RTIC_IRQHandler(void)
{   CAAM_RTIC_DriverIRQHandler();
}

WEAK void CDOG_IRQHandler(void)
{   CDOG_DriverIRQHandler();
}

WEAK void SAI1_IRQHandler(void)
{   SAI1_DriverIRQHandler();
}

WEAK void SAI2_IRQHandler(void)
{   SAI2_DriverIRQHandler();
}

WEAK void SAI3_RX_IRQHandler(void)
{   SAI3_RX_DriverIRQHandler();
}

WEAK void SAI3_TX_IRQHandler(void)
{   SAI3_TX_DriverIRQHandler();
}

WEAK void SAI4_RX_IRQHandler(void)
{   SAI4_RX_DriverIRQHandler();
}

WEAK void SAI4_TX_IRQHandler(void)
{   SAI4_TX_DriverIRQHandler();
}

WEAK void SPDIF_IRQHandler(void)
{   SPDIF_DriverIRQHandler();
}

WEAK void TMPSNS_INT_IRQHandler(void)
{   TMPSNS_INT_DriverIRQHandler();
}

WEAK void TMPSNS_LOW_HIGH_IRQHandler(void)
{   TMPSNS_LOW_HIGH_DriverIRQHandler();
}

WEAK void TMPSNS_PANIC_IRQHandler(void)
{   TMPSNS_PANIC_DriverIRQHandler();
}

WEAK void LPSR_LP8_BROWNOUT_IRQHandler(void)
{   LPSR_LP8_BROWNOUT_DriverIRQHandler();
}

WEAK void LPSR_LP0_BROWNOUT_IRQHandler(void)
{   LPSR_LP0_BROWNOUT_DriverIRQHandler();
}

WEAK void ADC1_IRQHandler(void)
{   ADC1_DriverIRQHandler();
}

WEAK void ADC2_IRQHandler(void)
{   ADC2_DriverIRQHandler();
}

WEAK void USBPHY1_IRQHandler(void)
{   USBPHY1_DriverIRQHandler();
}

WEAK void USBPHY2_IRQHandler(void)
{   USBPHY2_DriverIRQHandler();
}

WEAK void RDC_IRQHandler(void)
{   RDC_DriverIRQHandler();
}

WEAK void GPIO13_Combined_0_31_IRQHandler(void)
{   GPIO13_Combined_0_31_DriverIRQHandler();
}

WEAK void Reserved110_IRQHandler(void)
{   Reserved110_DriverIRQHandler();
}

WEAK void DCIC1_IRQHandler(void)
{   DCIC1_DriverIRQHandler();
}

WEAK void DCIC2_IRQHandler(void)
{   DCIC2_DriverIRQHandler();
}

WEAK void ASRC_IRQHandler(void)
{   ASRC_DriverIRQHandler();
}

WEAK void FLEXRAM_ECC_IRQHandler(void)
{   FLEXRAM_ECC_DriverIRQHandler();
}

WEAK void CM7_GPIO2_3_IRQHandler(void)
{   CM7_GPIO2_3_DriverIRQHandler();
}

WEAK void GPIO1_Combined_0_15_IRQHandler(void)
{   GPIO1_Combined_0_15_DriverIRQHandler();
}

WEAK void GPIO1_Combined_16_31_IRQHandler(void)
{   GPIO1_Combined_16_31_DriverIRQHandler();
}

WEAK void GPIO2_Combined_0_15_IRQHandler(void)
{   GPIO2_Combined_0_15_DriverIRQHandler();
}

WEAK void GPIO2_Combined_16_31_IRQHandler(void)
{   GPIO2_Combined_16_31_DriverIRQHandler();
}

WEAK void GPIO3_Combined_0_15_IRQHandler(void)
{   GPIO3_Combined_0_15_DriverIRQHandler();
}

WEAK void GPIO3_Combined_16_31_IRQHandler(void)
{   GPIO3_Combined_16_31_DriverIRQHandler();
}

WEAK void GPIO4_Combined_0_15_IRQHandler(void)
{   GPIO4_Combined_0_15_DriverIRQHandler();
}

WEAK void GPIO4_Combined_16_31_IRQHandler(void)
{   GPIO4_Combined_16_31_DriverIRQHandler();
}

WEAK void GPIO5_Combined_0_15_IRQHandler(void)
{   GPIO5_Combined_0_15_DriverIRQHandler();
}

WEAK void GPIO5_Combined_16_31_IRQHandler(void)
{   GPIO5_Combined_16_31_DriverIRQHandler();
}

WEAK void FLEXIO1_IRQHandler(void)
{   FLEXIO1_DriverIRQHandler();
}

WEAK void FLEXIO2_IRQHandler(void)
{   FLEXIO2_DriverIRQHandler();
}

WEAK void WDOG1_IRQHandler(void)
{   WDOG1_DriverIRQHandler();
}

WEAK void RTWDOG3_IRQHandler(void)
{   RTWDOG3_DriverIRQHandler();
}

WEAK void EWM_IRQHandler(void)
{   EWM_DriverIRQHandler();
}

WEAK void OCOTP_READ_FUSE_ERROR_IRQHandler(void)
{   OCOTP_READ_FUSE_ERROR_DriverIRQHandler();
}

WEAK void OCOTP_READ_DONE_ERROR_IRQHandler(void)
{   OCOTP_READ_DONE_ERROR_DriverIRQHandler();
}

WEAK void GPC_IRQHandler(void)
{   GPC_DriverIRQHandler();
}

WEAK void MUA_IRQHandler(void)
{   MUA_DriverIRQHandler();
}

WEAK void GPT1_IRQHandler(void)
{   GPT1_DriverIRQHandler();
}

WEAK void GPT2_IRQHandler(void)
{   GPT2_DriverIRQHandler();
}

